# Задание 1-1
# Вводится два числа x и y. Вывести x+y и x*y

x = float(input('Введите число x: '))
y = float(input('Введите число y: '))

print('************************************************')
print(f'Сумма чисел равна {x + y}, а произведение равно {x * y}')